Tekla Open API Reference for Tekla Structures 2025
Operation.IsMacroRunning Method
 Returns true if a macro is running, false otherwise.
Macros are saved as *.cs files in the folder defined with the XS_MACRO_DIRECTORY variable.
See Tekla Structures Help for more information about macros.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsMacroRunning()
Public Shared Function IsMacroRunning As Boolean
Return Value
Type: Boolean
True if a macro is running.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace